FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1751.h
#define FIO2SET0 (*(volatile unsigned char *)0x2009C058)
#define FIO2SET0_OFFSET 0x58

#define FIO2SET1 (*(volatile unsigned char *)0x2009C059)
#define FIO2SET1_OFFSET 0x59

#define FIO2SET2 (*(volatile unsigned char *)0x2009C05A)
#define FIO2SET2_OFFSET 0x5A

#define FIO2SET3 (*(volatile unsigned char *)0x2009C05B)
#define FIO2SET3_OFFSET 0x5B

#define FIO2SETL (*(volatile unsigned short *)0x2009C058)
#define FIO2SETL_OFFSET 0x58

#define FIO2SETU (*(volatile unsigned short *)0x2009C05A)
#define FIO2SETH FIO2SETU
#define FIO2SETU_OFFSET 0x5A
#define FIO2SETH_OFFSET FIO2SETU_OFFSET

#define FIO3SET (*(volatile unsigned long *)0x2009C078)
#define FIO3SET_OFFSET 0x78

#define FIO3SET0 (*(volatile unsigned char *)0x2009C078)
#define FIO3SET0_OFFSET 0x78

#define FIO3SET1 (*(volatile unsigned char *)0x2009C079)
#define FIO3SET1_OFFSET 0x79

#define FIO3SET2 (*(volatile unsigned char *)0x2009C07A)
#define FIO3SET2_OFFSET 0x7A

#define FIO3SET3 (*(volatile unsigned char *)0x2009C07B)
#define FIO3SET3_OFFSET 0x7B

#define FIO3SETL (*(volatile unsigned short *)0x2009C078)
#define FIO3SETL_OFFSET 0x78

#define FIO3SETU (*(volatile unsigned short *)0x2009C07A)
#define FIO3SETH FIO3SETU
#define FIO3SETU_OFFSET 0x7A
#define FIO3SETH_OFFSET FIO3SETU_OFFSET

#define FIO4SET (*(volatile unsigned long *)0x2009C098)
#define FIO4SET_OFFSET 0x98

#define FIO4SET0 (*(volatile unsigned char *)0x2009C098)
#define FIO4SET0_OFFSET 0x98

#define FIO4SET1 (*(volatile unsigned char *)0x2009C099)
#define FIO4SET1_OFFSET 0x99

#define FIO4SET2 (*(volatile unsigned char *)0x2009C09A)
#define FIO4SET2_OFFSET 0x9A

#define FIO4SET3 (*(volatile unsigned char *)0x2009C09B)
#define FIO4SET3_OFFSET 0x9B

#define FIO4SETL (*(volatile unsigned short *)0x2009C098)
#define FIO4SETL_OFFSET 0x98

#define FIO4SETU (*(volatile unsigned short *)0x2009C09A)
#define FIO4SETH FIO4SETU
#define FIO4SETU_OFFSET 0x9A
#define FIO4SETH_OFFSET FIO4SETU_OFFSET

#define FIO0CLR (*(volatile unsigned long *)0x2009C01C)
#define FIO0CLR_OFFSET 0x1C

#define FIO0CLR0 (*(volatile unsigned char *)0x2009C01C)
#define FIO0CLR0_OFFSET 0x1C

#define FIO0CLR1 (*(volatile unsigned char *)0x2009C01D)
#define FIO0CLR1_OFFSET 0x1D

#define FIO0CLR2 (*(volatile unsigned char *)0x2009C01E)
#define FIO0CLR2_OFFSET 0x1E

#define FIO0CLR3 (*(volatile unsigned char *)0x2009C01F)
#define FIO0CLR3_OFFSET 0x1F

#define FIO0CLRL (*(volatile unsigned short *)0x2009C01C)
#define FIO0CLRL_OFFSET 0x1C

#define FIO0CLRU (*(volatile unsigned short *)0x2009C01E)
#define FIO0CLRH FIO0CLRU
#define FIO0CLRU_OFFSET 0x1E
#define FIO0CLRH_OFFSET FIO0CLRU_OFFSET

#define FIO1CLR (*(volatile unsigned long *)0x2009C03C)
#define FIO1CLR_OFFSET 0x3C

#define FIO1CLR0 (*(volatile unsigned char *)0x2009C03C)
#define FIO1CLR0_OFFSET 0x3C

#define FIO1CLR1 (*(volatile unsigned char *)0x2009C03D)
#define FIO1CLR1_OFFSET 0x3D

#define FIO1CLR2 (*(volatile unsigned char *)0x2009C03E)
#define FIO1CLR2_OFFSET 0x3E

#define FIO1CLR3 (*(volatile unsigned char *)0x2009C03F)
#define FIO1CLR3_OFFSET 0x3F

#define FIO1CLRL (*(volatile unsigned short *)0x2009C03C)
#define FIO1CLRL_OFFSET 0x3C

#define FIO1CLRU (*(volatile unsigned short *)0x2009C03E)
#define FIO1CLRH FIO1CLRU
#define FIO1CLRU_OFFSET 0x3E
#define FIO1CLRH_OFFSET FIO1CLRU_OFFSET

#define FIO2CLR (*(volatile unsigned long *)0x2009C05C)
#define FIO2CLR_OFFSET 0x5C

#define FIO2CLR0 (*(volatile unsigned char *)0x2009C05C)
#define FIO2CLR0_OFFSET 0x5C

#define FIO2CLR1 (*(volatile unsigned char *)0x2009C05D)
#define FIO2CLR1_OFFSET 0x5D

#define FIO2CLR2 (*(volatile unsigned char *)0x2009C05E)
#define FIO2CLR2_OFFSET 0x5E

#define FIO2CLR3 (*(volatile unsigned char *)0x2009C05F)
#define FIO2CLR3_OFFSET 0x5F

#define FIO2CLRL (*(volatile unsigned short *)0x2009C05C)
#define FIO2CLRL_OFFSET 0x5C

#define FIO2CLRU (*(volatile unsigned short *)0x2009C05E)
#define FIO2CLRH FIO2CLRU
#define FIO2CLRU_OFFSET 0x5E
#define FIO2CLRH_OFFSET FIO2CLRU_OFFSET

#define FIO3CLR (*(volatile unsigned long *)0x2009C07C)
#define FIO3CLR_OFFSET 0x7C

#define FIO3CLR0 (*(volatile unsigned char *)0x2009C07C)
#define FIO3CLR0_OFFSET 0x7C

#define FIO3CLR1 (*(volatile unsigned char *)0x2009C07D)
#define FIO3CLR1_OFFSET 0x7D

#define FIO3CLR2 (*(volatile unsigned char *)0x2009C07E)
#define FIO3CLR2_OFFSET 0x7E

#define FIO3CLR3 (*(volatile unsigned char *)0x2009C07F)
#define FIO3CLR3_OFFSET 0x7F

#define FIO3CLRL (*(volatile unsigned short *)0x2009C07C)
#define FIO3CLRL_OFFSET 0x7C

#define FIO3CLRU (*(volatile unsigned short *)0x2009C07E)
#define FIO3CLRH FIO3CLRU
#define FIO3CLRU_OFFSET 0x7E
#define FIO3CLRH_OFFSET FIO3CLRU_OFFSET

#define FIO4CLR (*(volatile unsigned long *)0x2009C09C)
#define FIO4CLR_OFFSET 0x9C

#define FIO4CLR0 (*(volatile unsigned char *)0x2009C09C)
#define FIO4CLR0_OFFSET 0x9C

#define FIO4CLR1 (*(volatile unsigned char *)0x2009C09D)
#define FIO4CLR1_OFFSET 0x9D

#define FIO4CLR2 (*(volatile unsigned char *)0x2009C09E)
#define FIO4CLR2_OFFSET 0x9E

#define FIO4CLR3 (*(volatile unsigned char *)0x2009C09F)
#define FIO4CLR3_OFFSET 0x9F

#define FIO4CLRL (*(volatile unsigned short *)0x2009C09C)
#define FIO4CLRL_OFFSET 0x9C

#define FIO4CLRU (*(volatile unsigned short *)0x2009C09E)
#define FIO4CLRH FIO4CLRU
#define FIO4CLRU_OFFSET 0x9E
#define FIO4CLRH_OFFSET FIO4CLRU_OFFSET

#define WDT_BASE_ADDRESS 0x40000000

#define WDMOD (*(volatile unsigned long *)0x40000000)
#define WDMOD_OFFSET 0x0
#define WDMOD_WDEN_MASK 0x1
#define WDMOD_WDEN 0x1
#define WDMOD_WDEN_BIT 0
#define WDMOD_WDRESET_MASK 0x2
#define WDMOD_WDRESET 0x2
#define WDMOD_WDRESET_BIT 1
#define WDMOD_WDTOF_MASK 0x4
#define WDMOD_WDTOF 0x4
#define WDMOD_WDTOF_BIT 2
#define WDMOD_WDINT_MASK 0x8
#define WDMOD_WDINT 0x8
#define WDMOD_WDINT_BIT 3

#define WDTC (*(volatile unsigned long *)0x40000004)
#define WDTC_OFFSET 0x4

#define WDFEED (*(volatile unsigned long *)0x40000008)
#define WDFEED_OFFSET 0x8

#define WDTV (*(volatile unsigned long *)0x4000000C)
#define WDTV_OFFSET 0xC

