FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1751.h
#define PINMODE_OD3 (*(volatile unsigned long *)0x4002C074)
#define PINMODE_OD3_OFFSET 0x74
#define PINMODE_OD3_P3_0OD_MASK 0x1
#define PINMODE_OD3_P3_0OD 0x1
#define PINMODE_OD3_P3_0OD_BIT 0
#define PINMODE_OD3_P3_1OD_MASK 0x2
#define PINMODE_OD3_P3_1OD 0x2
#define PINMODE_OD3_P3_1OD_BIT 1
#define PINMODE_OD3_P3_2OD_MASK 0x4
#define PINMODE_OD3_P3_2OD 0x4
#define PINMODE_OD3_P3_2OD_BIT 2
#define PINMODE_OD3_P3_3OD_MASK 0x8
#define PINMODE_OD3_P3_3OD 0x8
#define PINMODE_OD3_P3_3OD_BIT 3
#define PINMODE_OD3_P3_4OD_MASK 0x10
#define PINMODE_OD3_P3_4OD 0x10
#define PINMODE_OD3_P3_4OD_BIT 4
#define PINMODE_OD3_P3_5OD_MASK 0x20
#define PINMODE_OD3_P3_5OD 0x20
#define PINMODE_OD3_P3_5OD_BIT 5
#define PINMODE_OD3_P3_6OD_MASK 0x40
#define PINMODE_OD3_P3_6OD 0x40
#define PINMODE_OD3_P3_6OD_BIT 6
#define PINMODE_OD3_P3_7OD_MASK 0x80
#define PINMODE_OD3_P3_7OD 0x80
#define PINMODE_OD3_P3_7OD_BIT 7
#define PINMODE_OD3_P3_8OD_MASK 0x100
#define PINMODE_OD3_P3_8OD 0x100
#define PINMODE_OD3_P3_8OD_BIT 8
#define PINMODE_OD3_P3_9OD_MASK 0x200
#define PINMODE_OD3_P3_9OD 0x200
#define PINMODE_OD3_P3_9OD_BIT 9
#define PINMODE_OD3_P3_10OD_MASK 0x400
#define PINMODE_OD3_P3_10OD 0x400
#define PINMODE_OD3_P3_10OD_BIT 10
#define PINMODE_OD3_P3_11OD_MASK 0x800
#define PINMODE_OD3_P3_11OD 0x800
#define PINMODE_OD3_P3_11OD_BIT 11
#define PINMODE_OD3_P3_12OD_MASK 0x1000
#define PINMODE_OD3_P3_12OD 0x1000
#define PINMODE_OD3_P3_12OD_BIT 12
#define PINMODE_OD3_P3_13OD_MASK 0x2000
#define PINMODE_OD3_P3_13OD 0x2000
#define PINMODE_OD3_P3_13OD_BIT 13
#define PINMODE_OD3_P3_14OD_MASK 0x4000
#define PINMODE_OD3_P3_14OD 0x4000
#define PINMODE_OD3_P3_14OD_BIT 14
#define PINMODE_OD3_P3_15OD_MASK 0x8000
#define PINMODE_OD3_P3_15OD 0x8000
#define PINMODE_OD3_P3_15OD_BIT 15
#define PINMODE_OD3_P3_16OD_MASK 0x10000
#define PINMODE_OD3_P3_16OD 0x10000
#define PINMODE_OD3_P3_16OD_BIT 16
#define PINMODE_OD3_P3_17OD_MASK 0x20000
#define PINMODE_OD3_P3_17OD 0x20000
#define PINMODE_OD3_P3_17OD_BIT 17
#define PINMODE_OD3_P3_18OD_MASK 0x40000
#define PINMODE_OD3_P3_18OD 0x40000
#define PINMODE_OD3_P3_18OD_BIT 18
#define PINMODE_OD3_P3_19OD_MASK 0x80000
#define PINMODE_OD3_P3_19OD 0x80000
#define PINMODE_OD3_P3_19OD_BIT 19
#define PINMODE_OD3_P3_20OD_MASK 0x100000
#define PINMODE_OD3_P3_20OD 0x100000
#define PINMODE_OD3_P3_20OD_BIT 20
#define PINMODE_OD3_P3_21OD_MASK 0x200000
#define PINMODE_OD3_P3_21OD 0x200000
#define PINMODE_OD3_P3_21OD_BIT 21
#define PINMODE_OD3_P3_22OD_MASK 0x400000
#define PINMODE_OD3_P3_22OD 0x400000
#define PINMODE_OD3_P3_22OD_BIT 22
#define PINMODE_OD3_P3_23OD_MASK 0x800000
#define PINMODE_OD3_P3_23OD 0x800000
#define PINMODE_OD3_P3_23OD_BIT 23
#define PINMODE_OD3_P3_24OD_MASK 0x1000000
#define PINMODE_OD3_P3_24OD 0x1000000
#define PINMODE_OD3_P3_24OD_BIT 24
#define PINMODE_OD3_P3_25OD_MASK 0x2000000
#define PINMODE_OD3_P3_25OD 0x2000000
#define PINMODE_OD3_P3_25OD_BIT 25
#define PINMODE_OD3_P3_26OD_MASK 0x4000000
#define PINMODE_OD3_P3_26OD 0x4000000
#define PINMODE_OD3_P3_26OD_BIT 26
#define PINMODE_OD3_P3_27OD_MASK 0x8000000
#define PINMODE_OD3_P3_27OD 0x8000000
#define PINMODE_OD3_P3_27OD_BIT 27
#define PINMODE_OD3_P3_28OD_MASK 0x10000000
#define PINMODE_OD3_P3_28OD 0x10000000
#define PINMODE_OD3_P3_28OD_BIT 28
#define PINMODE_OD3_P3_29OD_MASK 0x20000000
#define PINMODE_OD3_P3_29OD 0x20000000
#define PINMODE_OD3_P3_29OD_BIT 29
#define PINMODE_OD3_P3_30OD_MASK 0x40000000
#define PINMODE_OD3_P3_30OD 0x40000000
#define PINMODE_OD3_P3_30OD_BIT 30
#define PINMODE_OD3_P3_31OD_MASK 0x80000000
#define PINMODE_OD3_P3_31OD 0x80000000
#define PINMODE_OD3_P3_31OD_BIT 31

#define PINMODE_OD5 (*(volatile unsigned long *)0x4002C078)
#define PINMODE_OD5_OFFSET 0x78
#define PINMODE_OD5_P4_0OD_MASK 0x1
#define PINMODE_OD5_P4_0OD 0x1
#define PINMODE_OD5_P4_0OD_BIT 0
#define PINMODE_OD5_P4_1OD_MASK 0x2
#define PINMODE_OD5_P4_1OD 0x2
#define PINMODE_OD5_P4_1OD_BIT 1
#define PINMODE_OD5_P4_2OD_MASK 0x4
#define PINMODE_OD5_P4_2OD 0x4
#define PINMODE_OD5_P4_2OD_BIT 2
#define PINMODE_OD5_P4_3OD_MASK 0x8
#define PINMODE_OD5_P4_3OD 0x8
#define PINMODE_OD5_P4_3OD_BIT 3
#define PINMODE_OD5_P4_4OD_MASK 0x10
#define PINMODE_OD5_P4_4OD 0x10
#define PINMODE_OD5_P4_4OD_BIT 4
#define PINMODE_OD5_P4_5OD_MASK 0x20
#define PINMODE_OD5_P4_5OD 0x20
#define PINMODE_OD5_P4_5OD_BIT 5
#define PINMODE_OD5_P4_6OD_MASK 0x40
#define PINMODE_OD5_P4_6OD 0x40
#define PINMODE_OD5_P4_6OD_BIT 6
#define PINMODE_OD5_P4_7OD_MASK 0x80
#define PINMODE_OD5_P4_7OD 0x80
#define PINMODE_OD5_P4_7OD_BIT 7
#define PINMODE_OD5_P4_8OD_MASK 0x100
#define PINMODE_OD5_P4_8OD 0x100
#define PINMODE_OD5_P4_8OD_BIT 8
#define PINMODE_OD5_P4_9OD_MASK 0x200
#define PINMODE_OD5_P4_9OD 0x200
#define PINMODE_OD5_P4_9OD_BIT 9
#define PINMODE_OD5_P4_10OD_MASK 0x400
#define PINMODE_OD5_P4_10OD 0x400
#define PINMODE_OD5_P4_10OD_BIT 10
#define PINMODE_OD5_P4_11OD_MASK 0x800
#define PINMODE_OD5_P4_11OD 0x800
#define PINMODE_OD5_P4_11OD_BIT 11
#define PINMODE_OD5_P4_12OD_MASK 0x1000
#define PINMODE_OD5_P4_12OD 0x1000
#define PINMODE_OD5_P4_12OD_BIT 12
#define PINMODE_OD5_P4_13OD_MASK 0x2000
#define PINMODE_OD5_P4_13OD 0x2000
#define PINMODE_OD5_P4_13OD_BIT 13
#define PINMODE_OD5_P4_14OD_MASK 0x4000
#define PINMODE_OD5_P4_14OD 0x4000
#define PINMODE_OD5_P4_14OD_BIT 14
#define PINMODE_OD5_P4_15OD_MASK 0x8000
#define PINMODE_OD5_P4_15OD 0x8000
#define PINMODE_OD5_P4_15OD_BIT 15
#define PINMODE_OD5_P4_16OD_MASK 0x10000
#define PINMODE_OD5_P4_16OD 0x10000
#define PINMODE_OD5_P4_16OD_BIT 16
#define PINMODE_OD5_P4_17OD_MASK 0x20000
#define PINMODE_OD5_P4_17OD 0x20000
#define PINMODE_OD5_P4_17OD_BIT 17
#define PINMODE_OD5_P4_18OD_MASK 0x40000
#define PINMODE_OD5_P4_18OD 0x40000
#define PINMODE_OD5_P4_18OD_BIT 18
#define PINMODE_OD5_P4_19OD_MASK 0x80000
#define PINMODE_OD5_P4_19OD 0x80000
#define PINMODE_OD5_P4_19OD_BIT 19
#define PINMODE_OD5_P4_20OD_MASK 0x100000
#define PINMODE_OD5_P4_20OD 0x100000
#define PINMODE_OD5_P4_20OD_BIT 20
#define PINMODE_OD5_P4_21OD_MASK 0x200000
#define PINMODE_OD5_P4_21OD 0x200000
#define PINMODE_OD5_P4_21OD_BIT 21
#define PINMODE_OD5_P4_22OD_MASK 0x400000
#define PINMODE_OD5_P4_22OD 0x400000
#define PINMODE_OD5_P4_22OD_BIT 22
#define PINMODE_OD5_P4_23OD_MASK 0x800000
#define PINMODE_OD5_P4_23OD 0x800000
#define PINMODE_OD5_P4_23OD_BIT 23
#define PINMODE_OD5_P4_24OD_MASK 0x1000000
#define PINMODE_OD5_P4_24OD 0x1000000
#define PINMODE_OD5_P4_24OD_BIT 24
#define PINMODE_OD5_P4_25OD_MASK 0x2000000
#define PINMODE_OD5_P4_25OD 0x2000000
#define PINMODE_OD5_P4_25OD_BIT 25
#define PINMODE_OD5_P4_26OD_MASK 0x4000000
#define PINMODE_OD5_P4_26OD 0x4000000
#define PINMODE_OD5_P4_26OD_BIT 26
#define PINMODE_OD5_P4_27OD_MASK 0x8000000
#define PINMODE_OD5_P4_27OD 0x8000000
#define PINMODE_OD5_P4_27OD_BIT 27
#define PINMODE_OD5_P4_28OD_MASK 0x10000000
#define PINMODE_OD5_P4_28OD 0x10000000
#define PINMODE_OD5_P4_28OD_BIT 28
#define PINMODE_OD5_P4_29OD_MASK 0x20000000
#define PINMODE_OD5_P4_29OD 0x20000000
#define PINMODE_OD5_P4_29OD_BIT 29
#define PINMODE_OD5_P4_30OD_MASK 0x40000000
#define PINMODE_OD5_P4_30OD 0x40000000
#define PINMODE_OD5_P4_30OD_BIT 30
#define PINMODE_OD5_P4_31OD_MASK 0x80000000
#define PINMODE_OD5_P4_31OD 0x80000000
#define PINMODE_OD5_P4_31OD_BIT 31

#define I2CPADCFG (*(volatile unsigned long *)0x4002C07C)
#define I2CPADCFG_OFFSET 0x7C
#define I2CPADCFG_SDADRV0_MASK 0x1
#define I2CPADCFG_SDADRV0 0x1
#define I2CPADCFG_SDADRV0_BIT 0
#define I2CPADCFG_SDAI2C0_MASK 0x2
#define I2CPADCFG_SDAI2C0 0x2
#define I2CPADCFG_SDAI2C0_BIT 1
#define I2CPADCFG_SCLDRV0_MASK 0x4
#define I2CPADCFG_SCLDRV0 0x4
#define I2CPADCFG_SCLDRV0_BIT 2
#define I2CPADCFG_SCLI2C0_MASK 0x8
#define I2CPADCFG_SCLI2C0 0x8
#define I2CPADCFG_SCLI2C0_BIT 3

#define SSP1_BASE_ADDRESS 0x40030000

#define SSP1CR0 (*(volatile unsigned long *)0x40030000)
#define SSP1CR0_OFFSET 0x0
#define SSP1CR0_SCR_MASK 0xFF00
#define SSP1CR0_SCR_BIT 8
#define SSP1CR0_CPHA_MASK 0x80
#define SSP1CR0_CPHA 0x80
#define SSP1CR0_CPHA_BIT 7
#define SSP1CR0_CPOL_MASK 0x40
#define SSP1CR0_CPOL 0x40
#define SSP1CR0_CPOL_BIT 6
#define SSP1CR0_FRF_MASK 0x30
#define SSP1CR0_FRF_BIT 4
#define SSP1CR0_DSS_MASK 0xF
#define SSP1CR0_DSS_BIT 0

