FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1751.h
#define SSP1CR1 (*(volatile unsigned long *)0x40030004)
#define SSP1CR1_OFFSET 0x4
#define SSP1CR1_SOD_MASK 0x8
#define SSP1CR1_SOD 0x8
#define SSP1CR1_SOD_BIT 3
#define SSP1CR1_MS_MASK 0x4
#define SSP1CR1_MS 0x4
#define SSP1CR1_MS_BIT 2
#define SSP1CR1_SSE_MASK 0x2
#define SSP1CR1_SSE 0x2
#define SSP1CR1_SSE_BIT 1
#define SSP1CR1_LBM_MASK 0x1
#define SSP1CR1_LBM 0x1
#define SSP1CR1_LBM_BIT 0

#define SSP1DR (*(volatile unsigned long *)0x40030008)
#define SSP1DR_OFFSET 0x8

#define SSP1SR (*(volatile unsigned long *)0x4003000C)
#define SSP1SR_OFFSET 0xC
#define SSP1SR_BSY_MASK 0x10
#define SSP1SR_BSY 0x10
#define SSP1SR_BSY_BIT 4
#define SSP1SR_RFF_MASK 0x8
#define SSP1SR_RFF 0x8
#define SSP1SR_RFF_BIT 3
#define SSP1SR_RNE_MASK 0x4
#define SSP1SR_RNE 0x4
#define SSP1SR_RNE_BIT 2
#define SSP1SR_TNF_MASK 0x2
#define SSP1SR_TNF 0x2
#define SSP1SR_TNF_BIT 1
#define SSP1SR_TFE_MASK 0x1
#define SSP1SR_TFE 0x1
#define SSP1SR_TFE_BIT 0

#define SSP1CPSR (*(volatile unsigned long *)0x40030010)
#define SSP1CPSR_OFFSET 0x10
#define SSP1CPSR_CPSDVSR_MASK 0xFF
#define SSP1CPSR_CPSDVSR_BIT 0

#define SSP1IMSC (*(volatile unsigned long *)0x40030014)
#define SSP1IMSC_OFFSET 0x14
#define SSP1IMSC_TXIM_MASK 0x8
#define SSP1IMSC_TXIM 0x8
#define SSP1IMSC_TXIM_BIT 3
#define SSP1IMSC_RXIM_MASK 0x4
#define SSP1IMSC_RXIM 0x4
#define SSP1IMSC_RXIM_BIT 2
#define SSP1IMSC_RTIM_MASK 0x2
#define SSP1IMSC_RTIM 0x2
#define SSP1IMSC_RTIM_BIT 1
#define SSP1IMSC_RORIM_MASK 0x1
#define SSP1IMSC_RORIM 0x1
#define SSP1IMSC_RORIM_BIT 0

#define SSP1RIS (*(volatile unsigned long *)0x40030018)
#define SSP1RIS_OFFSET 0x18
#define SSP1RIS_TXRIS_MASK 0x8
#define SSP1RIS_TXRIS 0x8
#define SSP1RIS_TXRIS_BIT 3
#define SSP1RIS_RXRIS_MASK 0x4
#define SSP1RIS_RXRIS 0x4
#define SSP1RIS_RXRIS_BIT 2
#define SSP1RIS_RTRIS_MASK 0x2
#define SSP1RIS_RTRIS 0x2
#define SSP1RIS_RTRIS_BIT 1
#define SSP1RIS_RORRIS_MASK 0x1
#define SSP1RIS_RORRIS 0x1
#define SSP1RIS_RORRIS_BIT 0

#define SSP1MIS (*(volatile unsigned long *)0x4003001C)
#define SSP1MIS_OFFSET 0x1C
#define SSP1MIS_TXMIS_MASK 0x8
#define SSP1MIS_TXMIS 0x8
#define SSP1MIS_TXMIS_BIT 3
#define SSP1MIS_RXMIS_MASK 0x4
#define SSP1MIS_RXMIS 0x4
#define SSP1MIS_RXMIS_BIT 2
#define SSP1MIS_RTMIS_MASK 0x2
#define SSP1MIS_RTMIS 0x2
#define SSP1MIS_RTMIS_BIT 1
#define SSP1MIS_RORMIS_MASK 0x1
#define SSP1MIS_RORMIS 0x1
#define SSP1MIS_RORMIS_BIT 0

#define SSP1ICR (*(volatile unsigned long *)0x40030020)
#define SSP1ICR_OFFSET 0x20
#define SSP1ICR_RTIC_MASK 0x2
#define SSP1ICR_RTIC 0x2
#define SSP1ICR_RTIC_BIT 1
#define SSP1ICR_RORIC_MASK 0x1
#define SSP1ICR_RORIC 0x1
#define SSP1ICR_RORIC_BIT 0

#define SSP1DMACR (*(volatile unsigned long *)0x40030024)
#define SSP1DMACR_OFFSET 0x24
#define SSP1DMACR_RXDMAE_MASK 0x1
#define SSP1DMACR_RXDMAE 0x1
#define SSP1DMACR_RXDMAE_BIT 0
#define SSP1DMACR_TXDMAE_MASK 0x2
#define SSP1DMACR_TXDMAE 0x2
#define SSP1DMACR_TXDMAE_BIT 1

#define AD_BASE_ADDRESS 0x40034000

#define ADCR (*(volatile unsigned *)0x40034000)
#define ADCR_OFFSET 0x0
#define ADCR_SEL_MASK 0xFF
#define ADCR_SEL_BIT 0
#define ADCR_CLKDIV_MASK 0xFF00
#define ADCR_CLKDIV_BIT 8
#define ADCR_BURST_MASK 0x10000
#define ADCR_BURST 0x10000
#define ADCR_BURST_BIT 16
#define ADCR_PDN_MASK 0x200000
#define ADCR_PDN 0x200000
#define ADCR_PDN_BIT 21
#define ADCR_START_MASK 0x7000000
#define ADCR_START_BIT 24
#define ADCR_EDGE_MASK 0x8000000
#define ADCR_EDGE 0x8000000
#define ADCR_EDGE_BIT 27

#define ADGDR (*(volatile unsigned *)0x40034004)
#define ADGDR_OFFSET 0x4
#define ADGDR_RESULT_MASK 0xFFF0
#define ADGDR_RESULT_BIT 4
#define ADGDR_CHN_MASK 0x7000000
#define ADGDR_CHN_BIT 24
#define ADGDR_OVERUN_MASK 0x40000000
#define ADGDR_OVERUN 0x40000000
#define ADGDR_OVERUN_BIT 30
#define ADGDR_DONE_MASK 0x80000000
#define ADGDR_DONE 0x80000000
#define ADGDR_DONE_BIT 31

#define ADINTEN (*(volatile unsigned *)0x4003400C)
#define ADINTEN_OFFSET 0xC
#define ADINTEN_ADINTEN0_MASK 0x1
#define ADINTEN_ADINTEN0 0x1
#define ADINTEN_ADINTEN0_BIT 0
#define ADINTEN_ADINTEN1_MASK 0x2
#define ADINTEN_ADINTEN1 0x2
#define ADINTEN_ADINTEN1_BIT 1
#define ADINTEN_ADINTEN2_MASK 0x4
#define ADINTEN_ADINTEN2 0x4
#define ADINTEN_ADINTEN2_BIT 2
#define ADINTEN_ADINTEN3_MASK 0x8
#define ADINTEN_ADINTEN3 0x8
#define ADINTEN_ADINTEN3_BIT 3
#define ADINTEN_ADINTEN4_MASK 0x10
#define ADINTEN_ADINTEN4 0x10
#define ADINTEN_ADINTEN4_BIT 4
#define ADINTEN_ADINTEN5_MASK 0x20
#define ADINTEN_ADINTEN5 0x20
#define ADINTEN_ADINTEN5_BIT 5
#define ADINTEN_ADINTEN6_MASK 0x40
#define ADINTEN_ADINTEN6 0x40
#define ADINTEN_ADINTEN6_BIT 6
#define ADINTEN_ADINTEN7_MASK 0x80
#define ADINTEN_ADINTEN7 0x80
#define ADINTEN_ADINTEN7_BIT 7
#define ADINTEN_ADGINTEN_MASK 0x100
#define ADINTEN_ADGINTEN 0x100
#define ADINTEN_ADGINTEN_BIT 8

#define ADDR0 (*(volatile unsigned *)0x40034010)
#define ADDR0_OFFSET 0x10
#define ADDR0_RESULT_MASK 0xFFF0
#define ADDR0_RESULT_BIT 4
#define ADDR0_OVERRUN_MASK 0x40000000
#define ADDR0_OVERRUN 0x40000000
#define ADDR0_OVERRUN_BIT 30
#define ADDR0_DONE_MASK 0x80000000
#define ADDR0_DONE 0x80000000
#define ADDR0_DONE_BIT 31

#define ADDR1 (*(volatile unsigned *)0x40034014)
#define ADDR1_OFFSET 0x14
#define ADDR1_RESULT_MASK 0xFFF0
#define ADDR1_RESULT_BIT 4
#define ADDR1_OVERRUN_MASK 0x40000000
#define ADDR1_OVERRUN 0x40000000
#define ADDR1_OVERRUN_BIT 30
#define ADDR1_DONE_MASK 0x80000000
#define ADDR1_DONE 0x80000000
#define ADDR1_DONE_BIT 31

#define ADDR2 (*(volatile unsigned *)0x40034018)
#define ADDR2_OFFSET 0x18
#define ADDR2_RESULT_MASK 0xFFF0
#define ADDR2_RESULT_BIT 4
#define ADDR2_OVERRUN_MASK 0x40000000
#define ADDR2_OVERRUN 0x40000000
#define ADDR2_OVERRUN_BIT 30
#define ADDR2_DONE_MASK 0x80000000
#define ADDR2_DONE 0x80000000
#define ADDR2_DONE_BIT 31

#define ADDR3 (*(volatile unsigned *)0x4003401C)
#define ADDR3_OFFSET 0x1C
#define ADDR3_RESULT_MASK 0xFFF0
#define ADDR3_RESULT_BIT 4
#define ADDR3_OVERRUN_MASK 0x40000000
#define ADDR3_OVERRUN 0x40000000
#define ADDR3_OVERRUN_BIT 30
#define ADDR3_DONE_MASK 0x80000000
#define ADDR3_DONE 0x80000000
#define ADDR3_DONE_BIT 31

#define ADDR4 (*(volatile unsigned *)0x40034020)
#define ADDR4_OFFSET 0x20
#define ADDR4_RESULT_MASK 0xFFF0
#define ADDR4_RESULT_BIT 4
#define ADDR4_OVERRUN_MASK 0x40000000
#define ADDR4_OVERRUN 0x40000000
#define ADDR4_OVERRUN_BIT 30
#define ADDR4_DONE_MASK 0x80000000
#define ADDR4_DONE 0x80000000
#define ADDR4_DONE_BIT 31

#define ADDR5 (*(volatile unsigned *)0x40034024)
#define ADDR5_OFFSET 0x24
#define ADDR5_RESULT_MASK 0xFFF0
#define ADDR5_RESULT_BIT 4
#define ADDR5_OVERRUN_MASK 0x40000000
#define ADDR5_OVERRUN 0x40000000
#define ADDR5_OVERRUN_BIT 30
#define ADDR5_DONE_MASK 0x80000000
#define ADDR5_DONE 0x80000000
#define ADDR5_DONE_BIT 31

#define ADDR6 (*(volatile unsigned *)0x40034028)
#define ADDR6_OFFSET 0x28
#define ADDR6_RESULT_MASK 0xFFF0
#define ADDR6_RESULT_BIT 4
#define ADDR6_OVERRUN_MASK 0x40000000
#define ADDR6_OVERRUN 0x40000000
#define ADDR6_OVERRUN_BIT 30
#define ADDR6_DONE_MASK 0x80000000
#define ADDR6_DONE 0x80000000
#define ADDR6_DONE_BIT 31

#define ADDR7 (*(volatile unsigned *)0x4003402C)
#define ADDR7_OFFSET 0x2C
#define ADDR7_RESULT_MASK 0xFFF0
#define ADDR7_RESULT_BIT 4
#define ADDR7_OVERRUN_MASK 0x40000000
#define ADDR7_OVERRUN 0x40000000
#define ADDR7_OVERRUN_BIT 30
#define ADDR7_DONE_MASK 0x80000000
#define ADDR7_DONE 0x80000000
#define ADDR7_DONE_BIT 31

