FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1751.h
#define CANSLEEPCLR (*(volatile unsigned long *)0x400FC110)
#define CANSLEEPCLR_OFFSET 0x110
#define CANSLEEPCLR_CAN1SLEEP_MASK 0x2
#define CANSLEEPCLR_CAN1SLEEP 0x2
#define CANSLEEPCLR_CAN1SLEEP_BIT 1
#define CANSLEEPCLR_CAN2SLEEP_MASK 0x4
#define CANSLEEPCLR_CAN2SLEEP 0x4
#define CANSLEEPCLR_CAN2SLEEP_BIT 2

#define CANWAKEFLAGS (*(volatile unsigned long *)0x400FC114)
#define CANWAKEFLAGS_OFFSET 0x114
#define CANWAKEFLAGS_CAN1WAKE_MASK 0x2
#define CANWAKEFLAGS_CAN1WAKE 0x2
#define CANWAKEFLAGS_CAN1WAKE_BIT 1
#define CANWAKEFLAGS_CAN2WAKE_MASK 0x4
#define CANWAKEFLAGS_CAN2WAKE 0x4
#define CANWAKEFLAGS_CAN2WAKE_BIT 2

#define EXTINT (*(volatile unsigned char *)0x400FC140)
#define EXTINT_OFFSET 0x140
#define EXTINT_EINT0_MASK 0x1
#define EXTINT_EINT0 0x1
#define EXTINT_EINT0_BIT 0
#define EXTINT_EINT1_MASK 0x2
#define EXTINT_EINT1 0x2
#define EXTINT_EINT1_BIT 1
#define EXTINT_EINT2_MASK 0x4
#define EXTINT_EINT2 0x4
#define EXTINT_EINT2_BIT 2
#define EXTINT_EINT3_MASK 0x8
#define EXTINT_EINT3 0x8
#define EXTINT_EINT3_BIT 3

#define EXTMODE (*(volatile unsigned char *)0x400FC148)
#define EXTMODE_OFFSET 0x148
#define EXTMODE_EXTMODE0_MASK 0x1
#define EXTMODE_EXTMODE0 0x1
#define EXTMODE_EXTMODE0_BIT 0
#define EXTMODE_EXTMODE1_MASK 0x2
#define EXTMODE_EXTMODE1 0x2
#define EXTMODE_EXTMODE1_BIT 1
#define EXTMODE_EXTMODE2_MASK 0x4
#define EXTMODE_EXTMODE2 0x4
#define EXTMODE_EXTMODE2_BIT 2
#define EXTMODE_EXTMODE3_MASK 0x8
#define EXTMODE_EXTMODE3 0x8
#define EXTMODE_EXTMODE3_BIT 3

#define EXTPOLAR (*(volatile unsigned char *)0x400FC14C)
#define EXTPOLAR_OFFSET 0x14C
#define EXTPOLAR_EXTPOLAR0_MASK 0x1
#define EXTPOLAR_EXTPOLAR0 0x1
#define EXTPOLAR_EXTPOLAR0_BIT 0
#define EXTPOLAR_EXTPOLAR1_MASK 0x2
#define EXTPOLAR_EXTPOLAR1 0x2
#define EXTPOLAR_EXTPOLAR1_BIT 1
#define EXTPOLAR_EXTPOLAR2_MASK 0x4
#define EXTPOLAR_EXTPOLAR2 0x4
#define EXTPOLAR_EXTPOLAR2_BIT 2
#define EXTPOLAR_EXTPOLAR3_MASK 0x8
#define EXTPOLAR_EXTPOLAR3 0x8
#define EXTPOLAR_EXTPOLAR3_BIT 3

#define RSID (*(volatile unsigned char *)0x400FC180)
#define RSID_OFFSET 0x180
#define RSID_POR_MASK 0x1
#define RSID_POR 0x1
#define RSID_POR_BIT 0
#define RSID_EXTR_MASK 0x2
#define RSID_EXTR 0x2
#define RSID_EXTR_BIT 1
#define RSID_WDTR_MASK 0x4
#define RSID_WDTR 0x4
#define RSID_WDTR_BIT 2
#define RSID_BODR_MASK 0x8
#define RSID_BODR 0x8
#define RSID_BODR_BIT 3

#define SCS (*(volatile unsigned char *)0x400FC1A0)
#define SCS_OFFSET 0x1A0
#define SCS_OSCRANGE_MASK 0x10
#define SCS_OSCRANGE 0x10
#define SCS_OSCRANGE_BIT 4
#define SCS_OSCEN_MASK 0x20
#define SCS_OSCEN 0x20
#define SCS_OSCEN_BIT 5
#define SCS_OSCSTAT_MASK 0x40
#define SCS_OSCSTAT 0x40
#define SCS_OSCSTAT_BIT 6

#define USBIntSt (*(volatile unsigned long *)0x400FC1C0)
#define USBIntSt_OFFSET 0x1C0
#define USBIntSt_USB_INT_REQ_LP_MASK 0x1
#define USBIntSt_USB_INT_REQ_LP 0x1
#define USBIntSt_USB_INT_REQ_LP_BIT 0
#define USBIntSt_USB_INT_REQ_HP_MASK 0x2
#define USBIntSt_USB_INT_REQ_HP 0x2
#define USBIntSt_USB_INT_REQ_HP_BIT 1
#define USBIntSt_USB_INT_REQ_DMA_MASK 0x4
#define USBIntSt_USB_INT_REQ_DMA 0x4
#define USBIntSt_USB_INT_REQ_DMA_BIT 2
#define USBIntSt_USB_NEED_CLK_MASK 0x100
#define USBIntSt_USB_NEED_CLK 0x100
#define USBIntSt_USB_NEED_CLK_BIT 8
#define USBIntSt_EN_USB_INTS_MASK 0x80000000
#define USBIntSt_EN_USB_INTS 0x80000000
#define USBIntSt_EN_USB_INTS_BIT 31

#define GPDMA_BASE_ADDRESS 0x50004000

#define DMACIntStat (*(volatile unsigned *)0x50004000)
#define DMACIntStat_OFFSET 0x0
#define DMACIntStat_IntStat_MASK 0xFF
#define DMACIntStat_IntStat_BIT 0

#define DMACIntTCStat (*(volatile unsigned *)0x50004004)
#define DMACIntTCStat_OFFSET 0x4
#define DMACIntTCStat_IntTCStat_MASK 0xFF
#define DMACIntTCStat_IntTCStat_BIT 0

#define DMACIntTCClear (*(volatile unsigned *)0x50004008)
#define DMACIntTCClear_OFFSET 0x8
#define DMACIntTCClear_IntTCClear_MASK 0xFF
#define DMACIntTCClear_IntTCClear_BIT 0

#define DMACIntErrStat (*(volatile unsigned *)0x5000400C)
#define DMACIntErrStat_OFFSET 0xC
#define DMACIntErrStat_IntErrStat_MASK 0xFF
#define DMACIntErrStat_IntErrStat_BIT 0

#define DMACIntErrClr (*(volatile unsigned *)0x50004010)
#define DMACIntErrClr_OFFSET 0x10
#define DMACIntErrClr_IntErrClr_MASK 0xFF
#define DMACIntErrClr_IntErrClr_BIT 0

#define DMACRawIntTCStat (*(volatile unsigned *)0x50004014)
#define DMACRawIntTCStat_OFFSET 0x14
#define DMACRawIntTCStat_RawIntTCStat_MASK 0xFF
#define DMACRawIntTCStat_RawIntTCStat_BIT 0

#define DMACRawIntErrStat (*(volatile unsigned *)0x50004018)
#define DMACRawIntErrStat_OFFSET 0x18
#define DMACRawIntErrStat_RawIntErrStat_MASK 0xFF
#define DMACRawIntErrStat_RawIntErrStat_BIT 0

#define DMACEnbldChns (*(volatile unsigned *)0x5000401C)
#define DMACEnbldChns_OFFSET 0x1C
#define DMACEnbldChns_EnabledChannels_MASK 0xFF
#define DMACEnbldChns_EnabledChannels_BIT 0

#define DMACSoftBReq (*(volatile unsigned *)0x50004020)
#define DMACSoftBReq_OFFSET 0x20
#define DMACSoftBReq_SoftBReq_MASK 0xFFFF
#define DMACSoftBReq_SoftBReq_BIT 0

#define DMACSoftSReq (*(volatile unsigned *)0x50004024)
#define DMACSoftSReq_OFFSET 0x24
#define DMACSoftSReq_SoftSReq_MASK 0xFFFF
#define DMACSoftSReq_SoftSReq_BIT 0

#define DMACSoftLBReq (*(volatile unsigned *)0x50004028)
#define DMACSoftLBReq_OFFSET 0x28
#define DMACSoftLBReq_SoftLBReq_MASK 0xFFFF
#define DMACSoftLBReq_SoftLBReq_BIT 0

#define DMACSoftLSReq (*(volatile unsigned *)0x5000402C)
#define DMACSoftLSReq_OFFSET 0x2C
#define DMACSoftLSReq_SoftLSReq_MASK 0xFFFF
#define DMACSoftLSReq_SoftLSReq_BIT 0

#define DMACConfig (*(volatile unsigned *)0x50004030)
#define DMACConfig_OFFSET 0x30
#define DMACConfig_E_MASK 0x1
#define DMACConfig_E 0x1
#define DMACConfig_E_BIT 0
#define DMACConfig_M_MASK 0x2
#define DMACConfig_M 0x2
#define DMACConfig_M_BIT 1

#define DMACSync (*(volatile unsigned *)0x50004034)
#define DMACSync_OFFSET 0x34
#define DMACSync_DMACSync_MASK 0xFFFF
#define DMACSync_DMACSync_BIT 0

#define DMACC0SrcAddr (*(volatile unsigned *)0x50004100)
#define DMACC0SrcAddr_OFFSET 0x100

